list_a = []
for i in range(4):  # iは0,1,2,3の値を取り、4回繰り返す
    list_a.append(2 * i) # list_aの末尾に2 * iの結果を追加する
print(list_a)


list_b = [21, 22, 23, 24]
list_c = []
for i in range(4): # iは0,1,2,3の値を取り、4回繰り返す
    list_c.append(list_b[i] // (3 * (i + 1)))
print(list_c)

'''計算欄(メモ)
(26)の計算　//は切り捨て除算
1回目のループ：21 // (3 * (0 + 1)) = 7
2回目のループ：22 // (3 * (1 + 1)) = 3
3回目のループ：23 // (3 * (2 + 1)) = 2
4回目のループ：24 // (3 * (3 + 1)) = 2

list_b = [7, 3, 2, 2]
'''

list_d = [2, 4, 1, 6, 9, 3, 5, 7]
d = 2
while d < 12:
    list_d.pop(11 % d)  # 11 % d番目（インデックス）の要素を取り出して削除する
    d += 2
print(list_d)

'''計算欄(メモ)
(27)の計算　dは初期値2なので、2,4,6,8,10の順で推移
1回目のループ：11 % 2 = 1 →　インデックス1を取り出す。取り出し後[2, 1, 6, 9, 3, 5, 7]
2回目のループ：11 % 4 = 3 →　インデックス3を取り出す。取り出し後[2, 1, 6, 3, 5, 7]
3回目のループ：11 % 6 = 5 →　インデックス5を取り出す。取り出し後[2, 1, 6, 3, 5]
4回目のループ：11 % 8 = 3 →　インデックス3を取り出す。取り出し後[2, 1, 6, 5]
5回目のループ：11 % 10 = 1 →　インデックス1を取り出す。取り出し後[2, 6, 5]

list_d = [2, 6, 5]
'''


list_e = [1, 2, 2, 7]
j = 0
for cd in [7, 3, 2, 6, 5]:
    if cd in list_e: # cdがlistにあるかチェック
        list_e.remove(cd) # 値がcdと一致する最初の要素を削除
        list_e.insert(j, 2 * cd) # インデックスjに値2 * cdを挿入
        j += 1
print(list_e)

'''計算欄(メモ)
(28)について、各ループの処理
cd = 7: list_e = [14, 1, 2, 2] ※ 7を削除し、2 * 7=14をインデックス0にインサート j = 1
cd = 3: list_eにないので、Falseとなり次のループへ
cd = 2: list_e = [14, 4, 1, 2] ※ 2を削除し、2 * 2=4をインデックス1にインサート j = 2
cd = 6: list_eにないので、Falseとなり次のループへ
cd = 5: list_eにないので、Falseとなり次のループへ

よって、最終結果 list_e = [14, 4, 1, 2]
'''

result = ''
for e in [20, 6, -2, 12]:
    if (e + 4) ** 2 < 30:
        result += 'A'
    elif 4 < e / 3:
        result += 'B'
    else:
        result += 'C'
print(result)
